src/cf/Documents/РасчетБонусовПромоутеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>РасчетБонусовПромоутеров</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БонусыДизайнеров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МесяцРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выплачено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Расчеты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СуммаБонусов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВыручки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БонусныйПроцент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидБонуса</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыБонусов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Промоутер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/InformationRegisters/ШкалаБонусныхПроцентовОтПромоутерскихПродаж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ШкалаБонусныхПроцентовОтПромоутерскихПродаж</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>БонусныйПроцент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НижнийПорогОбъемаПродаж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВерхнийПорогОбъемаПродаж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидБонуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыБонусов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ПродажиПромоутеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ПродажиПромоутеров</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаПродаж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ВидыБонусов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыБонусов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Личные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Групповые</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КотелПропорциональный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КотелРуководителя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проектные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Партнерские</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПартнерскиеГрупповые</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дизайнерские</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Промоутерские</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/РасчетБонусовПромоутеров/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура РассчитатьНаСервере()
	
	Объект.Расчеты.Очистить();
	//порядок расчета бонусов по мотивационной программе промоутеров:
	//1. промоутерские
	
	//рассчитываем  дизайнерские бонусы
	Запрос = Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	ШкалаБонусныхПроцентовОтПромоутерскихПродаж.Контрагент КАК Контрагент,
	|	СУММА(ПродажиПромоутеров.СуммаПродаж * (ШкалаБонусныхПроцентовОтПромоутерскихПродаж.БонусныйПроцент / 100)) КАК СуммаБонусов,
	|	ШкалаБонусныхПроцентовОтПромоутерскихПродаж.ВидБонуса КАК ВидБонуса,
	|	СРЕДНЕЕ(ШкалаБонусныхПроцентовОтПромоутерскихПродаж.БонусныйПроцент) КАК БонусныйПроцент,
	|	СУММА(ПродажиПромоутеров.СуммаПродаж) КАК СуммаВыручки,
	|	ШкалаБонусныхПроцентовОтПромоутерскихПродаж.Должность КАК Должность
	|ПОМЕСТИТЬ втПред
	|ИЗ
	|	РегистрСведений.ШкалаБонусныхПроцентовОтПромоутерскихПродаж КАК ШкалаБонусныхПроцентовОтПромоутерскихПродаж
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПродажиПромоутеров КАК ПродажиПромоутеров
	|		ПО ШкалаБонусныхПроцентовОтПромоутерскихПродаж.Контрагент = ПродажиПромоутеров.Контрагент
	|			И ШкалаБонусныхПроцентовОтПромоутерскихПродаж.НижнийПорогОбъемаПродаж <= ПродажиПромоутеров.СуммаПродаж
	|			И ШкалаБонусныхПроцентовОтПромоутерскихПродаж.ВерхнийПорогОбъемаПродаж >= ПродажиПромоутеров.СуммаПродаж
	|			И ШкалаБонусныхПроцентовОтПромоутерскихПродаж.Период = ПродажиПромоутеров.Период
	|ГДЕ
	|	ШкалаБонусныхПроцентовОтПромоутерскихПродаж.Период = &ВыбМесяц
	|	И ШкалаБонусныхПроцентовОтПромоутерскихПродаж.ВидБонуса = &ВидБонусаПромоутерские
	|
	|СГРУППИРОВАТЬ ПО
	|	ШкалаБонусныхПроцентовОтПромоутерскихПродаж.Контрагент,
	|	ШкалаБонусныхПроцентовОтПромоутерскихПродаж.ВидБонуса,
	|	ШкалаБонусныхПроцентовОтПромоутерскихПродаж.Должность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПред.Контрагент КАК Контрагент,
	|	втПред.СуммаБонусов КАК СуммаБонусов,
	|	втПред.ВидБонуса КАК ВидБонуса,
	|	втПред.БонусныйПроцент КАК БонусныйПроцент,
	|	втПред.СуммаВыручки КАК СуммаВыручки,
	|	Пользователи.Ссылка КАК Промоутер
	|ПОМЕСТИТЬ втОбщ
	|ИЗ
	|	втПред КАК втПред
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	|		ПО втПред.Должность = Пользователи.Должность
	|			И (НЕ Пользователи.ПометкаУдаления)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втОбщ.Контрагент КАК Контрагент,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ втОбщ.Промоутер) КАК КоличествоПромоутеров
	|ПОМЕСТИТЬ втРазличные
	|ИЗ
	|	втОбщ КАК втОбщ
	|
	|СГРУППИРОВАТЬ ПО
	|	втОбщ.Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втОбщ.Контрагент КАК Контрагент,
	|	втОбщ.СуммаБонусов / втРазличные.КоличествоПромоутеров КАК СуммаБонусов,
	|	втОбщ.ВидБонуса КАК ВидБонуса,
	|	втОбщ.БонусныйПроцент КАК БонусныйПроцент,
	|	втОбщ.СуммаВыручки / втРазличные.КоличествоПромоутеров КАК СуммаВыручки,
	|	втОбщ.Промоутер КАК Промоутер
	|ИЗ
	|	втОбщ КАК втОбщ
	|		ЛЕВОЕ СОЕДИНЕНИЕ втРазличные КАК втРазличные
	|		ПО втОбщ.Контрагент = втРазличные.Контрагент";
	Запрос.УстановитьПараметр("ВыбМесяц", НачалоМесяца(Объект.МесяцРасчета));
	Запрос.УстановитьПараметр("ВидБонусаПромоутерские", Перечисления.ВидыБонусов.Промоутерские);
 
    тзБонусы = Запрос.Выполнить().Выгрузить();
	
	Объект.Расчеты.Загрузить(тзБонусы);   	
	
КонецПроцедуры

&НаКлиенте
Процедура Рассчитать()
	
	Если Объект.Расчеты.Количество()>0 тогда
		ДиалогСВопросом();
	Иначе
		РассчитатьНаСервере();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ДиалогСВопросом()
 
    Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса",
      ЭтотОбъект);	
 
    ПоказатьВопрос(Оповещение,
        "Табличная часть расчетов будет очищена и документ будет записан. Продолжить?",
        РежимДиалогаВопрос.ДаНетОтмена,
        0, // таймаут в секундах
        КодВозвратаДиалога.Да, // (необ.) кнопка по умолчанию
        "Хороший вопрос" // (необ.) заголовок
    );    
 
КонецПроцедуры
 
&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
 
	Если Результат = КодВозвратаДиалога.Да Тогда
        РассчитатьНаСервере();
    КонецЕсли;	
 
КонецПроцедуры

&НаКлиенте
Процедура МесяцРасчетаПриИзменении(Элемент)
	
	Объект.Расчеты.Очистить();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Объект.Ссылка.Пустая() и Объект.Выплачено тогда
		
		Этаформа.Доступность = Ложь;
			
	КонецЕсли; 	

КонецПроцедуры
